/*

------------------------------------------------

기존 이진 트리 기반 정렬 해주는 맵이랑 셋

대신

정렬 안된 맵과 셋 생김!

------------------------------------------------

## 해쉬맵

-> 자동으로 정렬되지 않는 컨테이너 = 해쉬 맵
-> 요소는 해쉬 함수가 생성하는 색인(index) 기반의 버킷(bucket)로 구성

## 해쉬 함수 : 복잡한 키를 정수 형으로 처리

-> 해쉬 충돌 : 키가 다른데 같은 해쉬 값이 나옴, 이럴 경우 하나의 버킷에 둘 이상의 데이터가 들어감


------------------------------------------------

## 어레이 Array

-> FixedVector 과 비슷
-> 요소 수를 기억하지 않음, 내가 몇개 가지고 있는지 몰라~

-> array.size() 와 array.max_size() 똑같음~~


------------------------------------------------

## FOR EACH
	## for (int score : scores)

	## for (auto& score : scoreMap)


------------------------------------------------


*/